Revit 2027 API
ParameterTypeId.StairsRailingBalusterSpacingType Property
 "Baluster Spacing Type (Stair Railing Only)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingBalusterSpacingType { get; }
Public Shared ReadOnly Property StairsRailingBalusterSpacingType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingBalusterSpacingType {
	ForgeTypeId^ get ();
}
static member StairsRailingBalusterSpacingType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace